#include "cppruntime.hpp"
#include "gc/src/runtime/memory/gc.h"
#include "gc/src/runtime/memory/threadinfo.h"
[[maybe_unused]] constexpr auto subtypes = []() constexpr { __CoreCpp::SubtypeTable<72> s{};
     s.set<7, 3, 5, 8>();
     s.set<15, 10, 13, 16>();
     s.set<26, 17, 24, 27>();
     s.set<32, 28, 30, 33>();
     s.set<37, 34, 35, 38>();
     s.set<43, 39, 41, 44>();
     s.set<48, 45, 46, 49>();
     s.set<60, 58, 59>();
     s.set<62, 58, 61>();
     s.set<64, 58, 63>();
     s.set<66, 58, 65>();
     s.set<68, 58, 67>();
     s.set<70, 58, 69>();
     s.set<72, 58, 71>();
return s;}();
//
// Primitive Types
//
__CoreGC::TypeInfoBase Boolğ“ğ²ğ©ğ = {
    .type_id = 50,
    .type_size = 8, 
    .slot_size = 1,
    .tag = __CoreGC::Tag::Value,
    .ptr_mask = "0",
    .typekey = "__CoreCpp::Bool",
    .vtable = nullptr
};
__CoreGC::TypeInfoBase CCharBufferğ“ğ²ğ©ğ = {
    .type_id = 4,
    .type_size = 16, 
    .slot_size = 2,
    .tag = __CoreGC::Tag::Value,
    .ptr_mask = "00",
    .typekey = "__CoreCpp::CCharBuffer",
    .vtable = nullptr
};
__CoreGC::TypeInfoBase Floatğ“ğ²ğ©ğ = {
    .type_id = 11,
    .type_size = 8, 
    .slot_size = 1,
    .tag = __CoreGC::Tag::Value,
    .ptr_mask = "0",
    .typekey = "__CoreCpp::Float",
    .vtable = nullptr
};
__CoreGC::TypeInfoBase Natğ“ğ²ğ©ğ = {
    .type_id = 1,
    .type_size = 8, 
    .slot_size = 1,
    .tag = __CoreGC::Tag::Value,
    .ptr_mask = "0",
    .typekey = "__CoreCpp::Nat",
    .vtable = nullptr
};

    typedef __CoreCpp::Boxed<1> Optioná¸ListOpsá˜Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³á³;
    typedef __CoreCpp::Boxed<1> Optioná¸ListOpsá˜Nodeá¸Mainá˜Bodyá³á³;
    struct Someá¸CRopeOpsá˜Nodeá³;
    struct Someá¸ListOpsá˜Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³á³;
    struct Someá¸ListOpsá˜Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³á³;
    struct Someá¸ListOpsá˜Nodeá¸ä¸¨Natá§Natä¸¨á³á³;
    struct Someá¸ListOpsá˜Nodeá¸Floatá³á³;
    struct Someá¸ListOpsá˜Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³á³;
    struct Someá¸ListOpsá˜Nodeá¸Mainá˜Bodyá³á³;
    namespace Algorithm {
    }
    namespace CCharBufferOps {
    }
    namespace CRopeOps {
        struct BBLeaf;
        struct Leaf;
        struct Node;
        typedef __CoreCpp::Boxed<2> Rope;
    }
    namespace ListOps {
        struct BBLeafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³;
        struct BBLeafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³;
        struct BBLeafá¸ä¸¨Natá§Natä¸¨á³;
        struct BBLeafá¸Floatá³;
        struct BBLeafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³;
        struct BBLeafá¸Mainá˜Bodyá³;
        struct Leafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³;
        struct Leafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³;
        struct Leafá¸ä¸¨Natá§Natä¸¨á³;
        struct Leafá¸Floatá³;
        struct Leafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³;
        struct Leafá¸Mainá˜Bodyá³;
        struct Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³;
        struct Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³;
        struct Nodeá¸ä¸¨Natá§Natä¸¨á³;
        struct Nodeá¸Floatá³;
        struct Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³;
        struct Nodeá¸Mainá˜Bodyá³;
        typedef __CoreCpp::Boxed<3> Treeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³;
        typedef __CoreCpp::Boxed<1> Treeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³;
        typedef __CoreCpp::Boxed<2> Treeá¸ä¸¨Natá§Natä¸¨á³;
        typedef __CoreCpp::Boxed<1> Treeá¸Floatá³;
        typedef __CoreCpp::Boxed<1> Treeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³;
        typedef __CoreCpp::Boxed<1> Treeá¸Mainá˜Bodyá³;
    }
    namespace NumericOps {
    }
}
namespace Main {
    struct Body;
    struct NBodySystem;
    struct Position;
    struct Velocity;
}
namespace Core {
    typedef CRopeOps::Rope CRope;
    typedef CRope CString;
    typedef ListOps::Treeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³ Listá¸ä¸¨Floatá§Floatá§Floatä¸¨á³;
    typedef ListOps::Treeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³ Listá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³;
    typedef ListOps::Treeá¸ä¸¨Natá§Natä¸¨á³ Listá¸ä¸¨Natá§Natä¸¨á³;
    typedef ListOps::Treeá¸Floatá³ Listá¸Floatá³;
    typedef ListOps::Treeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³ Listá¸Listá¸ä¸¨Natá§Natä¸¨á³á³;
    typedef ListOps::Treeá¸Mainá˜Bodyá³ Listá¸Mainá˜Bodyá³;
}
namespace Main {
}
namespace Core {
}
namespace Main {
}
namespace Core {
//
// Value Type Definitions
//
    typedef __CoreCpp::CRopeIterator CRopeIterator;
    __CoreGC::TypeInfoBase Someá¸CRopeOpsá˜Nodeá³ğ“ğ²ğ©ğ = {
        .type_id = 59,
        .type_size = 8, 
        .slot_size = 1,
        .tag = __CoreGC::Tag::Value,
        .ptr_mask = "1",
        .typekey = "Some<CRopeOps::Node>",
        .vtable = nullptr
    };
    struct Someá¸CRopeOpsá˜Nodeá³ {
        CRopeOps::Node* value;
    };
    __CoreGC::TypeInfoBase Someá¸ListOpsá˜Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³á³ğ“ğ²ğ©ğ = {
        .type_id = 61,
        .type_size = 8, 
        .slot_size = 1,
        .tag = __CoreGC::Tag::Value,
        .ptr_mask = "1",
        .typekey = "Some<ListOps::Node<(|Float, Float, Float|)>>",
        .vtable = nullptr
    };
    struct Someá¸ListOpsá˜Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³á³ {
        ListOps::Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³* value;
    };
    __CoreGC::TypeInfoBase Someá¸ListOpsá˜Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³á³ğ“ğ²ğ©ğ = {
        .type_id = 63,
        .type_size = 8, 
        .slot_size = 1,
        .tag = __CoreGC::Tag::Value,
        .ptr_mask = "1",
        .typekey = "Some<ListOps::Node<(|Main::Body, Float, Float, Float|)>>",
        .vtable = nullptr
    };
    struct Someá¸ListOpsá˜Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³á³ {
        ListOps::Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³* value;
    };
    __CoreGC::TypeInfoBase Someá¸ListOpsá˜Nodeá¸ä¸¨Natá§Natä¸¨á³á³ğ“ğ²ğ©ğ = {
        .type_id = 65,
        .type_size = 8, 
        .slot_size = 1,
        .tag = __CoreGC::Tag::Value,
        .ptr_mask = "1",
        .typekey = "Some<ListOps::Node<(|Nat, Nat|)>>",
        .vtable = nullptr
    };
    struct Someá¸ListOpsá˜Nodeá¸ä¸¨Natá§Natä¸¨á³á³ {
        ListOps::Nodeá¸ä¸¨Natá§Natä¸¨á³* value;
    };
    __CoreGC::TypeInfoBase Someá¸ListOpsá˜Nodeá¸Floatá³á³ğ“ğ²ğ©ğ = {
        .type_id = 67,
        .type_size = 8, 
        .slot_size = 1,
        .tag = __CoreGC::Tag::Value,
        .ptr_mask = "1",
        .typekey = "Some<ListOps::Node<Float>>",
        .vtable = nullptr
    };
    struct Someá¸ListOpsá˜Nodeá¸Floatá³á³ {
        ListOps::Nodeá¸Floatá³* value;
    };
    __CoreGC::TypeInfoBase Someá¸ListOpsá˜Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³á³ğ“ğ²ğ©ğ = {
        .type_id = 69,
        .type_size = 8, 
        .slot_size = 1,
        .tag = __CoreGC::Tag::Value,
        .ptr_mask = "1",
        .typekey = "Some<ListOps::Node<List<(|Nat, Nat|)>>>",
        .vtable = nullptr
    };
    struct Someá¸ListOpsá˜Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³á³ {
        ListOps::Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³* value;
    };
    __CoreGC::TypeInfoBase Someá¸ListOpsá˜Nodeá¸Mainá˜Bodyá³á³ğ“ğ²ğ©ğ = {
        .type_id = 71,
        .type_size = 8, 
        .slot_size = 1,
        .tag = __CoreGC::Tag::Value,
        .ptr_mask = "1",
        .typekey = "Some<ListOps::Node<Main::Body>>",
        .vtable = nullptr
    };
    struct Someá¸ListOpsá˜Nodeá¸Mainá˜Bodyá³á³ {
        ListOps::Nodeá¸Mainá˜Bodyá³* value;
    };
//
// Ref and Tagged Type Definitions
//
    __CoreGC::TypeInfoBase Optioná¸CRopeOpsá˜Nodeá³ğ“ğ²ğ©ğ = {
        .type_id = 60,
        .type_size = 16, 
        .slot_size = 2,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "20",
        .typekey = "Option<CRopeOps::Node>",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase Optioná¸ListOpsá˜Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³á³ğ“ğ²ğ©ğ = {
        .type_id = 62,
        .type_size = 16, 
        .slot_size = 2,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "20",
        .typekey = "Option<ListOps::Node<(|Float, Float, Float|)>>",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase Optioná¸ListOpsá˜Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³á³ğ“ğ²ğ©ğ = {
        .type_id = 64,
        .type_size = 16, 
        .slot_size = 2,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "20",
        .typekey = "Option<ListOps::Node<(|Main::Body, Float, Float, Float|)>>",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase Optioná¸ListOpsá˜Nodeá¸ä¸¨Natá§Natä¸¨á³á³ğ“ğ²ğ©ğ = {
        .type_id = 66,
        .type_size = 16, 
        .slot_size = 2,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "20",
        .typekey = "Option<ListOps::Node<(|Nat, Nat|)>>",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase Optioná¸ListOpsá˜Nodeá¸Floatá³á³ğ“ğ²ğ©ğ = {
        .type_id = 68,
        .type_size = 16, 
        .slot_size = 2,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "20",
        .typekey = "Option<ListOps::Node<Float>>",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase Optioná¸ListOpsá˜Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³á³ğ“ğ²ğ©ğ = {
        .type_id = 70,
        .type_size = 16, 
        .slot_size = 2,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "20",
        .typekey = "Option<ListOps::Node<List<(|Nat, Nat|)>>>",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase Optioná¸ListOpsá˜Nodeá¸Mainá˜Bodyá³á³ğ“ğ²ğ©ğ = {
        .type_id = 72,
        .type_size = 16, 
        .slot_size = 2,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "20",
        .typekey = "Option<ListOps::Node<Main::Body>>",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase CRopeğ“ğ²ğ©ğ = {
        .type_id = 18,
        .type_size = 24, 
        .slot_size = 3,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "200",
        .typekey = "CRope",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase Listá¸ä¸¨Floatá§Floatá§Floatä¸¨á³ğ“ğ²ğ©ğ = {
        .type_id = 52,
        .type_size = 32, 
        .slot_size = 4,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "2000",
        .typekey = "List<(|Float, Float, Float|)>",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase Listá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³ğ“ğ²ğ©ğ = {
        .type_id = 53,
        .type_size = 16, 
        .slot_size = 2,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "20",
        .typekey = "List<(|Main::Body, Float, Float, Float|)>",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase Listá¸ä¸¨Natá§Natä¸¨á³ğ“ğ²ğ©ğ = {
        .type_id = 40,
        .type_size = 24, 
        .slot_size = 3,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "200",
        .typekey = "List<(|Nat, Nat|)>",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase Listá¸Floatá³ğ“ğ²ğ©ğ = {
        .type_id = 54,
        .type_size = 16, 
        .slot_size = 2,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "20",
        .typekey = "List<Float>",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase Listá¸Listá¸ä¸¨Natá§Natä¸¨á³á³ğ“ğ²ğ©ğ = {
        .type_id = 55,
        .type_size = 16, 
        .slot_size = 2,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "20",
        .typekey = "List<List<(|Nat, Nat|)>>",
        .vtable = nullptr
    };
    __CoreGC::TypeInfoBase Listá¸Mainá˜Bodyá³ğ“ğ²ğ©ğ = {
        .type_id = 56,
        .type_size = 16, 
        .slot_size = 2,
        .tag = __CoreGC::Tag::Tagged,
        .ptr_mask = "20",
        .typekey = "List<Main::Body>",
        .vtable = nullptr
    };
//
// All Methods
//
    __CoreCpp::CCharBuffer CRopeIteratorá˜next([[maybe_unused]] CRopeIterator &ğ­ğ¡ğ¢ğ¬) noexcept;
    __CoreCpp::Bool CRopeIteratorá˜hasNext([[maybe_unused]] CRopeIterator &ğ­ğ¡ğ¢ğ¬) noexcept;
    template <typename Î»fn_ä¸¨Floatá§Floatá§Floatä¸¨_$Float_f>
    Listá¸Floatá³ Listá¸ä¸¨Floatá§Floatá§Floatä¸¨á³á˜mapá¸Floatá³([[maybe_unused]] Listá¸ä¸¨Floatá§Floatá§Floatä¸¨á³ ğ­ğ¡ğ¢ğ¬, Î»fn_ä¸¨Floatá§Floatá§Floatä¸¨_$Float_f&& f) noexcept;
    template <typename Î»fn_ä¸¨Bodyá§Floatá§Floatá§Floatä¸¨_$Mainá˜Body_f>
    Listá¸Mainá˜Bodyá³ Listá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³á˜mapá¸Mainá˜Bodyá³([[maybe_unused]] Listá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³ ğ­ğ¡ğ¢ğ¬, Î»fn_ä¸¨Bodyá§Floatá§Floatá§Floatä¸¨_$Mainá˜Body_f&& f) noexcept;
    template <typename Î»fn_ä¸¨Natá§Natä¸¨_$Float_f>
    Listá¸Floatá³ Listá¸ä¸¨Natá§Natä¸¨á³á˜mapá¸Floatá³([[maybe_unused]] Listá¸ä¸¨Natá§Natä¸¨á³ ğ­ğ¡ğ¢ğ¬, Î»fn_ä¸¨Natá§Natä¸¨_$Float_f&& f) noexcept;
    __CoreCpp::Float Listá¸Floatá³á˜sum([[maybe_unused]] Listá¸Floatá³ ğ­ğ¡ğ¢ğ¬) noexcept;
    template <typename Î»fn_Listá¸ä¸¨Natá§Natä¸¨á³_$Float_f>
    Listá¸Floatá³ Listá¸Listá¸ä¸¨Natá§Natä¸¨á³á³á˜mapá¸Floatá³([[maybe_unused]] Listá¸Listá¸ä¸¨Natá§Natä¸¨á³á³ ğ­ğ¡ğ¢ğ¬, Î»fn_Listá¸ä¸¨Natá§Natä¸¨á³_$Float_f&& f) noexcept;
    __CoreCpp::Nat Listá¸Mainá˜Bodyá³á˜size([[maybe_unused]] Listá¸Mainá˜Bodyá³ ğ­ğ¡ğ¢ğ¬) noexcept;
    Main::Body* Listá¸Mainá˜Bodyá³á˜get([[maybe_unused]] Listá¸Mainá˜Bodyá³ ğ­ğ¡ğ¢ğ¬, __CoreCpp::Nat i) noexcept;
    template <typename Î»fn_Body_$Float_f>
    Listá¸Floatá³ Listá¸Mainá˜Bodyá³á˜mapá¸Floatá³([[maybe_unused]] Listá¸Mainá˜Bodyá³ ğ­ğ¡ğ¢ğ¬, Î»fn_Body_$Float_f&& f) noexcept;
    template <typename Î»fn_Body_$ä¸¨Floatá§Floatá§Floatä¸¨_f>
    Listá¸ä¸¨Floatá§Floatá§Floatä¸¨á³ Listá¸Mainá˜Bodyá³á˜mapá¸ä¸¨Floatá§Floatá§Floatä¸¨á³([[maybe_unused]] Listá¸Mainá˜Bodyá³ ğ­ğ¡ğ¢ğ¬, Î»fn_Body_$ä¸¨Floatá§Floatá§Floatä¸¨_f&& f) noexcept;
    template <typename Î»fn_Body_$ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨_f>
    Listá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³ Listá¸Mainá˜Bodyá³á˜mapá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³([[maybe_unused]] Listá¸Mainá˜Bodyá³ ğ­ğ¡ğ¢ğ¬, Î»fn_Body_$ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨_f&& f) noexcept;
    __CoreCpp::Nat CCharBufferá˜size([[maybe_unused]] __CoreCpp::CCharBuffer ğ­ğ¡ğ¢ğ¬) noexcept;
    namespace Algorithm {
//
// Value Type Definitions
//
//
// Ref and Tagged Type Definitions
//
//
// All Methods
//
    }
    namespace CCharBufferOps {
//
// Value Type Definitions
//
//
// Ref and Tagged Type Definitions
//
//
// All Methods
//
    }
    namespace CRopeOps {
//
// Value Type Definitions
//
        __CoreGC::TypeInfoBase Colorğ“ğ²ğ©ğ = {
            .type_id = 2,
            .type_size = 8, 
            .slot_size = 1,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = "0",
            .typekey = "CRopeOps::Color",
            .vtable = nullptr
        };
        enum class Color : uint64_t {
            Red,
            Black,
            BB,
            NB
        };
        __CoreGC::TypeInfoBase BBLeafğ“ğ²ğ©ğ = {
            .type_id = 3,
            .type_size = 0, 
            .slot_size = 0,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = nullptr,
            .typekey = "CRopeOps::BBLeaf",
            .vtable = nullptr
        };
        struct BBLeaf{ 
        };
        static_assert(sizeof(BBLeaf) == 1);
        enum Leaf_entries : uintptr_t {
            Leaf_buf
        };
        const __CoreGC::FieldOffsetInfo Leaf_vtable[] = {
            { 4, Leaf_entries::Leaf_buf, 0 }
        };
        __CoreGC::TypeInfoBase Leafğ“ğ²ğ©ğ = {
            .type_id = 5,
            .type_size = 16, 
            .slot_size = 2,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = "00",
            .typekey = "CRopeOps::Leaf",
            .vtable = nullptr
        };
        struct Leaf{ 
            __CoreCpp::CCharBuffer buf;
        };
        static_assert(sizeof(Leaf) == 16);
//
// Ref and Tagged Type Definitions
//
        enum Node_entries : uintptr_t {
            Node_c,
            Node_w,
            Node_l,
            Node_r
        };
        const __CoreGC::FieldOffsetInfo Node_vtable[] = {
            { 2, Node_entries::Node_c, 0 },
            { 1, Node_entries::Node_w, 8 },
            { 7, Node_entries::Node_l, 16 },
            { 7, Node_entries::Node_r, 24 }
        };
        __CoreGC::TypeInfoBase Nodeğ“ğ²ğ©ğ = {
            .type_id = 8,
            .type_size = 64, 
            .slot_size = 8,
            .tag = __CoreGC::Tag::Ref,
            .ptr_mask = "00200200",
            .typekey = "CRopeOps::Node",
            .vtable = nullptr
        };
        struct Node{ 
            Color c;
            __CoreCpp::Nat w;
            Rope l;
            Rope r;
        };
        static_assert(sizeof(Node) == 64);
        __CoreGC::TypeInfoBase Ropeğ“ğ²ğ©ğ = {
            .type_id = 7,
            .type_size = 24, 
            .slot_size = 3,
            .tag = __CoreGC::Tag::Tagged,
            .ptr_mask = "200",
            .typekey = "CRopeOps::Rope",
            .vtable = nullptr
        };
//
// All Methods
//
    }
    namespace ListOps {
//
// Value Type Definitions
//
        __CoreGC::TypeInfoBase Colorğ“ğ²ğ©ğ = {
            .type_id = 9,
            .type_size = 8, 
            .slot_size = 1,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = "0",
            .typekey = "ListOps::Color",
            .vtable = nullptr
        };
        enum class Color : uint64_t {
            Red,
            Black,
            BB,
            NB
        };
        __CoreGC::TypeInfoBase BBLeafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³ğ“ğ²ğ©ğ = {
            .type_id = 10,
            .type_size = 0, 
            .slot_size = 0,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = nullptr,
            .typekey = "ListOps::BBLeaf<(|Float, Float, Float|)>",
            .vtable = nullptr
        };
        struct BBLeafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³{ 
        };
        static_assert(sizeof(BBLeafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³) == 1);
        __CoreGC::TypeInfoBase BBLeafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³ğ“ğ²ğ©ğ = {
            .type_id = 17,
            .type_size = 0, 
            .slot_size = 0,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = nullptr,
            .typekey = "ListOps::BBLeaf<(|Main::Body, Float, Float, Float|)>",
            .vtable = nullptr
        };
        struct BBLeafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³{ 
        };
        static_assert(sizeof(BBLeafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³) == 1);
        __CoreGC::TypeInfoBase BBLeafá¸ä¸¨Natá§Natä¸¨á³ğ“ğ²ğ©ğ = {
            .type_id = 28,
            .type_size = 0, 
            .slot_size = 0,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = nullptr,
            .typekey = "ListOps::BBLeaf<(|Nat, Nat|)>",
            .vtable = nullptr
        };
        struct BBLeafá¸ä¸¨Natá§Natä¸¨á³{ 
        };
        static_assert(sizeof(BBLeafá¸ä¸¨Natá§Natä¸¨á³) == 1);
        __CoreGC::TypeInfoBase BBLeafá¸Floatá³ğ“ğ²ğ©ğ = {
            .type_id = 34,
            .type_size = 0, 
            .slot_size = 0,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = nullptr,
            .typekey = "ListOps::BBLeaf<Float>",
            .vtable = nullptr
        };
        struct BBLeafá¸Floatá³{ 
        };
        static_assert(sizeof(BBLeafá¸Floatá³) == 1);
        __CoreGC::TypeInfoBase BBLeafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³ğ“ğ²ğ©ğ = {
            .type_id = 39,
            .type_size = 0, 
            .slot_size = 0,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = nullptr,
            .typekey = "ListOps::BBLeaf<List<(|Nat, Nat|)>>",
            .vtable = nullptr
        };
        struct BBLeafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³{ 
        };
        static_assert(sizeof(BBLeafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³) == 1);
        __CoreGC::TypeInfoBase BBLeafá¸Mainá˜Bodyá³ğ“ğ²ğ©ğ = {
            .type_id = 45,
            .type_size = 0, 
            .slot_size = 0,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = nullptr,
            .typekey = "ListOps::BBLeaf<Main::Body>",
            .vtable = nullptr
        };
        struct BBLeafá¸Mainá˜Bodyá³{ 
        };
        static_assert(sizeof(BBLeafá¸Mainá˜Bodyá³) == 1);
        enum Leafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_entries : uintptr_t {
            Leafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_v
        };
        const __CoreGC::FieldOffsetInfo Leafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_vtable[] = {
            { 0, Leafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_entries::Leafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_v, 0 }
        };
        __CoreGC::TypeInfoBase Leafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³ğ“ğ²ğ©ğ = {
            .type_id = 13,
            .type_size = 24, 
            .slot_size = 3,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = "000",
            .typekey = "ListOps::Leaf<(|Float, Float, Float|)>",
            .vtable = nullptr
        };
        struct Leafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³{ 
            __CoreCpp::Tuple3<1, 1, 1> v;
        };
        static_assert(sizeof(Leafá¸ä¸¨Floatá§Floatá§Floatä¸¨á³) == 24);
        enum Leafá¸ä¸¨Natá§Natä¸¨á³_entries : uintptr_t {
            Leafá¸ä¸¨Natá§Natä¸¨á³_v
        };
        const __CoreGC::FieldOffsetInfo Leafá¸ä¸¨Natá§Natä¸¨á³_vtable[] = {
            { 0, Leafá¸ä¸¨Natá§Natä¸¨á³_entries::Leafá¸ä¸¨Natá§Natä¸¨á³_v, 0 }
        };
        __CoreGC::TypeInfoBase Leafá¸ä¸¨Natá§Natä¸¨á³ğ“ğ²ğ©ğ = {
            .type_id = 30,
            .type_size = 16, 
            .slot_size = 2,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = "00",
            .typekey = "ListOps::Leaf<(|Nat, Nat|)>",
            .vtable = nullptr
        };
        struct Leafá¸ä¸¨Natá§Natä¸¨á³{ 
            __CoreCpp::Tuple2<1, 1> v;
        };
        static_assert(sizeof(Leafá¸ä¸¨Natá§Natä¸¨á³) == 16);
        enum Leafá¸Floatá³_entries : uintptr_t {
            Leafá¸Floatá³_v
        };
        const __CoreGC::FieldOffsetInfo Leafá¸Floatá³_vtable[] = {
            { 11, Leafá¸Floatá³_entries::Leafá¸Floatá³_v, 0 }
        };
        __CoreGC::TypeInfoBase Leafá¸Floatá³ğ“ğ²ğ©ğ = {
            .type_id = 35,
            .type_size = 8, 
            .slot_size = 1,
            .tag = __CoreGC::Tag::Value,
            .ptr_mask = "0",
            .typekey = "ListOps::Leaf<Float>",
            .vtable = nullptr
        };
        struct Leafá¸Floatá³{ 
            __CoreCpp::Float v;
        };
        static_assert(sizeof(Leafá¸Floatá³) == 8);
//
// Ref and Tagged Type Definitions
//
        enum Leafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_entries : uintptr_t {
            Leafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_v
        };
        const __CoreGC::FieldOffsetInfo Leafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_vtable[] = {
            { 0, Leafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_entries::Leafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_v, 0 }
        };
        __CoreGC::TypeInfoBase Leafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³ğ“ğ²ğ©ğ = {
            .type_id = 24,
            .type_size = 32, 
            .slot_size = 4,
            .tag = __CoreGC::Tag::Ref,
            .ptr_mask = "1000",
            .typekey = "ListOps::Leaf<(|Main::Body, Float, Float, Float|)>",
            .vtable = nullptr
        };
        struct Leafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³{ 
            __CoreCpp::Tuple4<1, 1, 1, 1> v;
        };
        static_assert(sizeof(Leafá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³) == 32);
        enum Leafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_entries : uintptr_t {
            Leafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_v
        };
        const __CoreGC::FieldOffsetInfo Leafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_vtable[] = {
            { 40, Leafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_entries::Leafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_v, 0 }
        };
        __CoreGC::TypeInfoBase Leafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³ğ“ğ²ğ©ğ = {
            .type_id = 41,
            .type_size = 24, 
            .slot_size = 3,
            .tag = __CoreGC::Tag::Ref,
            .ptr_mask = "200",
            .typekey = "ListOps::Leaf<List<(|Nat, Nat|)>>",
            .vtable = nullptr
        };
        struct Leafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³{ 
            Listá¸ä¸¨Natá§Natä¸¨á³ v;
        };
        static_assert(sizeof(Leafá¸Listá¸ä¸¨Natá§Natä¸¨á³á³) == 24);
        enum Leafá¸Mainá˜Bodyá³_entries : uintptr_t {
            Leafá¸Mainá˜Bodyá³_v
        };
        const __CoreGC::FieldOffsetInfo Leafá¸Mainá˜Bodyá³_vtable[] = {
            { 22, Leafá¸Mainá˜Bodyá³_entries::Leafá¸Mainá˜Bodyá³_v, 0 }
        };
        __CoreGC::TypeInfoBase Leafá¸Mainá˜Bodyá³ğ“ğ²ğ©ğ = {
            .type_id = 46,
            .type_size = 8, 
            .slot_size = 1,
            .tag = __CoreGC::Tag::Ref,
            .ptr_mask = "1",
            .typekey = "ListOps::Leaf<Main::Body>",
            .vtable = nullptr
        };
        struct Leafá¸Mainá˜Bodyá³{ 
            Main::Body* v;
        };
        static_assert(sizeof(Leafá¸Mainá˜Bodyá³) == 8);
        enum Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_entries : uintptr_t {
            Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_c,
            Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_count,
            Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_l,
            Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_r
        };
        const __CoreGC::FieldOffsetInfo Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_vtable[] = {
            { 9, Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_entries::Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_c, 0 },
            { 1, Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_entries::Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_count, 8 },
            { 15, Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_entries::Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_l, 16 },
            { 15, Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_entries::Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³_r, 24 }
        };
        __CoreGC::TypeInfoBase Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³ğ“ğ²ğ©ğ = {
            .type_id = 16,
            .type_size = 80, 
            .slot_size = 10,
            .tag = __CoreGC::Tag::Ref,
            .ptr_mask = "0020002000",
            .typekey = "ListOps::Node<(|Float, Float, Float|)>",
            .vtable = nullptr
        };
        struct Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³{ 
            Color c;
            __CoreCpp::Nat count;
            Treeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³ l;
            Treeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³ r;
        };
        static_assert(sizeof(Nodeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³) == 80);
        enum Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_entries : uintptr_t {
            Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_c,
            Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_count,
            Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_l,
            Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_r
        };
        const __CoreGC::FieldOffsetInfo Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_vtable[] = {
            { 9, Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_entries::Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_c, 0 },
            { 1, Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_entries::Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_count, 8 },
            { 26, Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_entries::Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_l, 16 },
            { 26, Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_entries::Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³_r, 24 }
        };
        __CoreGC::TypeInfoBase Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³ğ“ğ²ğ©ğ = {
            .type_id = 27,
            .type_size = 48, 
            .slot_size = 6,
            .tag = __CoreGC::Tag::Ref,
            .ptr_mask = "002020",
            .typekey = "ListOps::Node<(|Main::Body, Float, Float, Float|)>",
            .vtable = nullptr
        };
        struct Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³{ 
            Color c;
            __CoreCpp::Nat count;
            Treeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³ l;
            Treeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³ r;
        };
        static_assert(sizeof(Nodeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³) == 48);
        enum Nodeá¸ä¸¨Natá§Natä¸¨á³_entries : uintptr_t {
            Nodeá¸ä¸¨Natá§Natä¸¨á³_c,
            Nodeá¸ä¸¨Natá§Natä¸¨á³_count,
            Nodeá¸ä¸¨Natá§Natä¸¨á³_l,
            Nodeá¸ä¸¨Natá§Natä¸¨á³_r
        };
        const __CoreGC::FieldOffsetInfo Nodeá¸ä¸¨Natá§Natä¸¨á³_vtable[] = {
            { 9, Nodeá¸ä¸¨Natá§Natä¸¨á³_entries::Nodeá¸ä¸¨Natá§Natä¸¨á³_c, 0 },
            { 1, Nodeá¸ä¸¨Natá§Natä¸¨á³_entries::Nodeá¸ä¸¨Natá§Natä¸¨á³_count, 8 },
            { 32, Nodeá¸ä¸¨Natá§Natä¸¨á³_entries::Nodeá¸ä¸¨Natá§Natä¸¨á³_l, 16 },
            { 32, Nodeá¸ä¸¨Natá§Natä¸¨á³_entries::Nodeá¸ä¸¨Natá§Natä¸¨á³_r, 24 }
        };
        __CoreGC::TypeInfoBase Nodeá¸ä¸¨Natá§Natä¸¨á³ğ“ğ²ğ©ğ = {
            .type_id = 33,
            .type_size = 64, 
            .slot_size = 8,
            .tag = __CoreGC::Tag::Ref,
            .ptr_mask = "00200200",
            .typekey = "ListOps::Node<(|Nat, Nat|)>",
            .vtable = nullptr
        };
        struct Nodeá¸ä¸¨Natá§Natä¸¨á³{ 
            Color c;
            __CoreCpp::Nat count;
            Treeá¸ä¸¨Natá§Natä¸¨á³ l;
            Treeá¸ä¸¨Natá§Natä¸¨á³ r;
        };
        static_assert(sizeof(Nodeá¸ä¸¨Natá§Natä¸¨á³) == 64);
        enum Nodeá¸Floatá³_entries : uintptr_t {
            Nodeá¸Floatá³_c,
            Nodeá¸Floatá³_count,
            Nodeá¸Floatá³_l,
            Nodeá¸Floatá³_r
        };
        const __CoreGC::FieldOffsetInfo Nodeá¸Floatá³_vtable[] = {
            { 9, Nodeá¸Floatá³_entries::Nodeá¸Floatá³_c, 0 },
            { 1, Nodeá¸Floatá³_entries::Nodeá¸Floatá³_count, 8 },
            { 37, Nodeá¸Floatá³_entries::Nodeá¸Floatá³_l, 16 },
            { 37, Nodeá¸Floatá³_entries::Nodeá¸Floatá³_r, 24 }
        };
        __CoreGC::TypeInfoBase Nodeá¸Floatá³ğ“ğ²ğ©ğ = {
            .type_id = 38,
            .type_size = 48, 
            .slot_size = 6,
            .tag = __CoreGC::Tag::Ref,
            .ptr_mask = "002020",
            .typekey = "ListOps::Node<Float>",
            .vtable = nullptr
        };
        struct Nodeá¸Floatá³{ 
            Color c;
            __CoreCpp::Nat count;
            Treeá¸Floatá³ l;
            Treeá¸Floatá³ r;
        };
        static_assert(sizeof(Nodeá¸Floatá³) == 48);
        enum Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_entries : uintptr_t {
            Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_c,
            Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_count,
            Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_l,
            Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_r
        };
        const __CoreGC::FieldOffsetInfo Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_vtable[] = {
            { 9, Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_entries::Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_c, 0 },
            { 1, Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_entries::Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_count, 8 },
            { 43, Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_entries::Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_l, 16 },
            { 43, Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_entries::Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³_r, 24 }
        };
        __CoreGC::TypeInfoBase Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³ğ“ğ²ğ©ğ = {
            .type_id = 44,
            .type_size = 48, 
            .slot_size = 6,
            .tag = __CoreGC::Tag::Ref,
            .ptr_mask = "002020",
            .typekey = "ListOps::Node<List<(|Nat, Nat|)>>",
            .vtable = nullptr
        };
        struct Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³{ 
            Color c;
            __CoreCpp::Nat count;
            Treeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³ l;
            Treeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³ r;
        };
        static_assert(sizeof(Nodeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³) == 48);
        enum Nodeá¸Mainá˜Bodyá³_entries : uintptr_t {
            Nodeá¸Mainá˜Bodyá³_c,
            Nodeá¸Mainá˜Bodyá³_count,
            Nodeá¸Mainá˜Bodyá³_l,
            Nodeá¸Mainá˜Bodyá³_r
        };
        const __CoreGC::FieldOffsetInfo Nodeá¸Mainá˜Bodyá³_vtable[] = {
            { 9, Nodeá¸Mainá˜Bodyá³_entries::Nodeá¸Mainá˜Bodyá³_c, 0 },
            { 1, Nodeá¸Mainá˜Bodyá³_entries::Nodeá¸Mainá˜Bodyá³_count, 8 },
            { 48, Nodeá¸Mainá˜Bodyá³_entries::Nodeá¸Mainá˜Bodyá³_l, 16 },
            { 48, Nodeá¸Mainá˜Bodyá³_entries::Nodeá¸Mainá˜Bodyá³_r, 24 }
        };
        __CoreGC::TypeInfoBase Nodeá¸Mainá˜Bodyá³ğ“ğ²ğ©ğ = {
            .type_id = 49,
            .type_size = 48, 
            .slot_size = 6,
            .tag = __CoreGC::Tag::Ref,
            .ptr_mask = "002020",
            .typekey = "ListOps::Node<Main::Body>",
            .vtable = nullptr
        };
        struct Nodeá¸Mainá˜Bodyá³{ 
            Color c;
            __CoreCpp::Nat count;
            Treeá¸Mainá˜Bodyá³ l;
            Treeá¸Mainá˜Bodyá³ r;
        };
        static_assert(sizeof(Nodeá¸Mainá˜Bodyá³) == 48);
        __CoreGC::TypeInfoBase Treeá¸ä¸¨Floatá§Floatá§Floatä¸¨á³ğ“ğ²ğ©ğ = {
            .type_id = 15,
            .type_size = 32, 
            .slot_size = 4,
            .tag = __CoreGC::Tag::Tagged,
            .ptr_mask = "2000",
            .typekey = "ListOps::Tree<(|Float, Float, Float|)>",
            .vtable = nullptr
        };
        __CoreGC::TypeInfoBase Treeá¸ä¸¨Mainá˜Bodyá§Floatá§Floatá§Floatä¸¨á³ğ“ğ²ğ©ğ = {
            .type_id = 26,
            .type_size = 16, 
            .slot_size = 2,
            .tag = __CoreGC::Tag::Tagged,
            .ptr_mask = "20",
            .typekey = "ListOps::Tree<(|Main::Body, Float, Float, Float|)>",
            .vtable = nullptr
        };
        __CoreGC::TypeInfoBase Treeá¸ä¸¨Natá§Natä¸¨á³ğ“ğ²ğ©ğ = {
            .type_id = 32,
            .type_size = 24, 
            .slot_size = 3,
            .tag = __CoreGC::Tag::Tagged,
            .ptr_mask = "200",
            .typekey = "ListOps::Tree<(|Nat, Nat|)>",
            .vtable = nullptr
        };
        __CoreGC::TypeInfoBase Treeá¸Floatá³ğ“ğ²ğ©ğ = {
            .type_id = 37,
            .type_size = 16, 
            .slot_size = 2,
            .tag = __CoreGC::Tag::Tagged,
            .ptr_mask = "20",
            .typekey = "ListOps::Tree<Float>",
            .vtable = nullptr
        };
        __CoreGC::TypeInfoBase Treeá¸Listá¸ä¸¨Natá§Natä¸¨á³á³ğ“ğ²ğ©ğ = {
            .type_id = 43,
            .type_size = 16, 
            .slot_size = 2,
            .tag = __CoreGC::Tag::Tagged,
            .ptr_mask = "20",
            .typekey = "ListOps::Tree<List<(|Nat, Nat|)>>",
            .vtable = nullptr
        };
        __CoreGC::TypeInfoBase Treeá¸Mainá˜Bodyá³ğ“ğ²ğ©ğ = {
            .type_id = 48,
            .type_size = 16, 
            .slot_size = 2,
            .tag = __CoreGC::Tag::Tagged,
            .ptr_mask = "20",
            .typekey = "ListOps::Tree<Main::Body>",
            .vtable = nullptr
        };
//
// All Methods
//
    }
    namespace NumericOps {
//
// Value Type Definitions
//
//
// Ref and Tagged Type Definitions
//
//
// All Methods
//
    }
}
namespace Main {
//
// Value Type Definitions
//
    enum Position_entries : uintptr_t {
        Position_x,
        Position_y,
        Position_z
    };
    const __CoreGC::FieldOffsetInfo Position_vtable[] = {
        { 11, Position_entries::Position_x, 0 },
        { 11, Position_entries::Position_y, 8 },
        { 11, Position_entries::Position_z, 16 }
    };
    __CoreGC::TypeInfoBase Positionğ“ğ²ğ©ğ = {
        .type_id = 20,
        .type_size = 24, 
        .slot_size = 3,
        .tag = __CoreGC::Tag::Value,
        .ptr_mask = "000",
        .typekey = "Main::Position",
        .vtable = nullptr
    };
    struct Position { 
        __CoreCpp::Float x;
        __CoreCpp::Float y;
        __CoreCpp::Float z;
    };
    static_assert(sizeof(Position) == 24);
    enum Velocity_entries : uintptr_t {
        Velocity_vx,
        Velocity_vy,
        Velocity_vz
    };
    const __CoreGC::FieldOffsetInfo Velocity_vtable[] = {
        { 11, Velocity_entries::Velocity_vx, 0 },
        { 11, Velocity_entries::Velocity_vy, 8 },
        { 11, Velocity_entries::Velocity_vz, 16 }
    };
    __CoreGC::TypeInfoBase Velocityğ“ğ²ğ©ğ = {
        .type_id = 21,
        .type_size = 24, 
        .slot_size = 3,
        .tag = __CoreGC::Tag::Value,
        .ptr_mask = "000",
        .typekey = "Main::Velocity",
        .vtable = nullptr
    };
    struct Velocity { 
        __CoreCpp::Float vx;
        __CoreCpp::Float vy;
        __CoreCpp::Float vz;
    };
    static_assert(sizeof(Velocity) == 24);
//
// Ref and Tagged Type Definitions
//
    enum Body_entries : uintptr_t {
        Body_name,
        Body_mass,
        Body_pos,
        Body_vel
    };
    const __CoreGC::FieldOffsetInfo Body_vtable[] = {
        { 19, Body_entries::Body_name, 0 },
        { 11, Body_entries::Body_mass, 8 },
        { 20, Body_entries::Body_pos, 16 },
        { 21, Body_entries::Body_vel, 24 }
    };
    __CoreGC::TypeInfoBase Bodyğ“ğ²ğ©ğ = {
        .type_id = 22,
        .type_size = 80, 
        .slot_size = 10,
        .tag = __CoreGC::Tag::Ref,
        .ptr_mask = "2000000000",
        .typekey = "Main::Body",
        .vtable = nullptr
    };
    struct Body { 
        Core::CString name;
        __CoreCpp::Float mass;
        Position pos;
        Velocity vel;
    };
    static_assert(sizeof(Body) == 80);
    enum NBodySystem_entries : uintptr_t {
        NBodySystem_bodies
    };
    const __CoreGC::FieldOffsetInfo NBodySystem_vtable[] = {
        { 56, NBodySystem_entries::NBodySystem_bodies, 0 }
    };
    __CoreGC::TypeInfoBase NBodySystemğ“ğ²ğ©ğ = {
        .type_id = 57,
        .type_size = 16, 
        .slot_size = 2,
        .tag = __CoreGC::Tag::Ref,
        .ptr_mask = "20",
        .typekey = "Main::NBodySystem",
        .vtable = nullptr
    };
    struct NBodySystem { 
        Core::Listá¸Mainá˜Bodyá³ bodies;
    };
    static_assert(sizeof(NBodySystem) == 16);
//
// All Methods
//
    Body* Bodyá˜offsetMomentum([[maybe_unused]] Body* ğ­ğ¡ğ¢ğ¬, __CoreCpp::Float px, __CoreCpp::Float py, __CoreCpp::Float pz) noexcept;
    __CoreCpp::Float Bodyá˜kineticEnergy([[maybe_unused]] Body* ğ­ğ¡ğ¢ğ¬) noexcept;
    __CoreCpp::Float NBodySystemá˜potentialEnergyCompute([[maybe_unused]] NBodySystem* ğ­ğ¡ğ¢ğ¬, Core::Listá¸ä¸¨Natá§Natä¸¨á³ ppairs) noexcept;
    __CoreCpp::Float NBodySystemá˜energy([[maybe_unused]] NBodySystem* ğ­ğ¡ğ¢ğ¬) noexcept;
    NBodySystem* NBodySystemá˜advance([[maybe_unused]] NBodySystem* ğ­ğ¡ğ¢ğ¬, __CoreCpp::Float dt) noexcept;
}
//
// Namespace/Type Function Forward Declarations
//
namespace Core {
    namespace Algorithm {
        template <typename Î»pred_ä¸¨CCharBufferá§CCharBufferä¸¨_$Bool_guard, typename Î»fn_ä¸¨CCharBufferá§CCharBufferä¸¨_$ä¸¨CCharBufferá§CCharBufferä¸¨_op>
